examples/pressuretest/GPU_gas/slau2_2/system/fvSchemes
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}

fluxScheme      SLAU2.2;

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default                             none;
    div(phi,U)                          Gauss upwind;
    div(phid,p)                         Gauss limitedLinear 1;
    div(phi,e)                          Gauss limitedLinear 1;
    div(phi,K)                          Gauss limitedLinear 1;
    div(phi,(p|rho))                    Gauss limitedLinear 1;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p               ;
}
